In [50]:
import datetime
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
data1 = pd.read_excel("../Data/online_retail_II.xlsx", sheet_name="Year 2009-2010")
data2 = pd.read_excel("../Data/online_retail_II.xlsx", sheet_name="Year 2010-2011")

In [4]:
data1.head(10)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom
5,489434,22064,PINK DOUGHNUT TRINKET POT,24,2009-12-01 07:45:00,1.65,13085.0,United Kingdom
6,489434,21871,SAVE THE PLANET MUG,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom
7,489434,21523,FANCY FONT HOME SWEET HOME DOORMAT,10,2009-12-01 07:45:00,5.95,13085.0,United Kingdom
8,489435,22350,CAT BOWL,12,2009-12-01 07:46:00,2.55,13085.0,United Kingdom
9,489435,22349,"DOG BOWL , CHASING BALL DESIGN",12,2009-12-01 07:46:00,3.75,13085.0,United Kingdom

In [5]:
data1.nunique()

Invoice        28816
StockCode       4632
Description     4681
Quantity         825
InvoiceDate    25296
Price           1606
Customer ID     4383
Country           40
dtype: int64

In [6]:
data1.Country.value_counts()

United Kingdom          485852
EIRE                      9670
Germany                   8129
France                    5772
Netherlands               2769
Spain                     1278
Switzerland               1187
Portugal                  1101
Belgium                   1054
Channel Islands            906
Sweden                     902
Italy                      731
Australia                  654
Cyprus                     554
Austria                    537
Greece                     517
United Arab Emirates       432
Denmark                    428
Norway                     369
Finland                    354
Unspecified                310
USA                        244
Japan                      224
Poland                     194
Malta                      172
Lithuania                  154
Singapore                  117
RSA                        111
Bahrain                    107
Canada                      77
Hong Kong                   76
Thailand                    76
Israel                      74
Iceland                     71
Korea                       63
Brazil                      62
West Indies                 54
Bermuda                     34
Nigeria                     32
Lebanon                     13
Name: Country, dtype: int64

In [7]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 525461 entries, 0 to 525460
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      525461 non-null  object
 1   StockCode    525461 non-null  object
 2   Description  522533 non-null  object
 3   Quantity     525461 non-null  int64
 4   InvoiceDate  525461 non-null  datetime64[ns]
 5   Price        525461 non-null  float64
 6   Customer ID  417534 non-null  float64
 7   Country      525461 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 32.1+ MB

In [8]:
data2.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [9]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541910 entries, 0 to 541909
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      541910 non-null  object
 1   StockCode    541910 non-null  object
 2   Description  540456 non-null  object
 3   Quantity     541910 non-null  int64
 4   InvoiceDate  541910 non-null  datetime64[ns]
 5   Price        541910 non-null  float64
 6   Customer ID  406830 non-null  float64
 7   Country      541910 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [10]:
data1.isnull().sum()

Invoice             0
StockCode           0
Description      2928
Quantity            0
InvoiceDate         0
Price               0
Customer ID    107927
Country             0
dtype: int64

In [11]:
data2.isnull().sum()

Invoice             0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
Price               0
Customer ID    135080
Country             0
dtype: int64

In [12]:
data1.to_pickle("../Data/Sales09-10.pkl")
data2.to_pickle("../Data/Sales10-11.pkl")

In [46]:
data1_cleaned = data1.drop(columns=['Description'])
data1_cleaned_1 = data1_cleaned[data1_cleaned['Country'] == 'United Kingdom']
data1_cleaned_1['total_amount'] = data1_cleaned_1['Price'] * data1_cleaned_1['Quantity']
data1_cleaned_2 = data1_cleaned_1.drop(columns=['Quantity', 'Price', 'Country', 'StockCode'])
data1_agg = data1_cleaned_2.groupby(['Invoice', 'Customer ID', 'InvoiceDate'], as_index=False).sum()
data1_agg_1 = data1_agg.drop(columns=['Invoice', 'Customer ID'])
data1_agg_1.head(10)

/var/folders/8r/sf09gm417452y_p81bzf8kp00000gn/T/ipykernel_34664/2786169098.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data1_cleaned_1['total_amount'] = data1_cleaned_1['Price'] * data1_cleaned_1['Quantity']

          InvoiceDate  total_amount
0 2009-12-01 07:45:00        505.30
1 2009-12-01 07:46:00        145.80
2 2009-12-01 09:06:00        630.33
3 2009-12-01 09:08:00        310.75
4 2009-12-01 09:24:00       2286.24
5 2009-12-01 09:43:00         50.40
6 2009-12-01 09:44:00        344.34
7 2009-12-01 09:46:00        382.37
8 2009-12-01 09:50:00        285.06
9 2009-12-01 09:57:00        308.44

In [45]:
data2_cleaned = data2.drop(columns=['Description'])
data2_cleaned_1 = data2_cleaned[data2_cleaned['Country'] == 'United Kingdom']
data2_cleaned_1['total_amount'] = data2_cleaned_1['Price'] * data2_cleaned_1['Quantity']
data2_cleaned_2 = data2_cleaned_1.drop(columns=['Quantity', 'Price', 'Country', 'StockCode'])
data2_agg = data2_cleaned_2.groupby(['Invoice', 'Customer ID', 'InvoiceDate'], as_index=False).sum()
data2_agg_1 = data2_agg.drop(columns=['Invoice', 'Customer ID'])
data2_agg_1.head(10)

/var/folders/8r/sf09gm417452y_p81bzf8kp00000gn/T/ipykernel_34664/4204326256.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data2_cleaned_1['total_amount'] = data2_cleaned_1['Price'] * data2_cleaned_1['Quantity']

          InvoiceDate  total_amount
0 2010-12-01 08:26:00        139.12
1 2010-12-01 08:28:00         22.20
2 2010-12-01 08:34:00        278.73
3 2010-12-01 08:34:00         70.05
4 2010-12-01 08:35:00         17.85
5 2010-12-01 09:00:00        204.00
6 2010-12-01 09:01:00         22.20
7 2010-12-01 09:02:00        259.86
8 2010-12-01 09:09:00        350.40
9 2010-12-01 09:32:00        259.86

In [ ]:
data1_agg_1.to_pickle("../Data/total_sales_09-10.pkl")
data2_agg_1.to_pickle("../Data/total_sales_10-11.pkl")

In [70]:
data1_agg_2 = data1_agg_1.copy()
data1_agg_2['hour'] = [int(ele.strftime("%H")) for ele in data1_agg_1['InvoiceDate']]
data1_agg_2['date'] = [ele.strftime("%Y-%m-%d") for ele in data1_agg_1['InvoiceDate']]
data1_agg_2['weekday'] = [ele.weekday() for ele in data1_agg_1['InvoiceDate']]
data1_agg_3 = data1_agg_2.groupby(['date', 'weekday', 'hour'], as_index = False).sum()
data1_agg_3.head()

         date  weekday  hour  total_amount
0  2009-12-01        1     7        651.10
1  2009-12-01        1     9       4597.93
2  2009-12-01        1    10       4077.76
3  2009-12-01        1    11       4460.96
4  2009-12-01        1    12       8056.24

In [71]:
data2_agg_2 = data2_agg_1.copy()
data2_agg_2['hour'] = [int(ele.strftime("%H")) for ele in data2_agg_1['InvoiceDate']]
data2_agg_2['date'] = [ele.strftime("%Y-%m-%d") for ele in data2_agg_1['InvoiceDate']]
data2_agg_2['weekday'] = [ele.weekday() for ele in data2_agg_1['InvoiceDate']]
data2_agg_3 = data2_agg_2.groupby(['date', 'weekday', 'hour'], as_index = False).sum()
data2_agg_3.head()

         date  weekday  hour  total_amount
0  2010-12-01        2     8        527.95
1  2010-12-01        2     9       7324.24
2  2010-12-01        2    10       4736.08
3  2010-12-01        2    11       4041.56
4  2010-12-01        2    12       7422.42

In [72]:
data1_agg_3.to_pickle("../Data/total_sales_09-10_cleaned.pkl")
data2_agg_3.to_pickle("../Data/total_sales_10-11_cleaned.pkl")